БИТУправление_медицинским_центром_демо/src/Catalogs/Подразделения/Подразделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Подразделения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегдаПоказыватьВОтбореЖурналаЗаписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСпособЗаполненияГрафика</name>
    <type>
      <types>CatalogRef.СпособыЗаполненияГрафиковРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеМинздрава</name>
    <type>
      <types>CatalogRef.СтруктураПодразделений</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОтделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/СтруктураПодразделений/СтруктураПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураПодразделений</name>
  <attributes>
    <name>OIDСтруктурногоПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТестовыйКонтур</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Атрибуты</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/Подразделения/Forms/ФормаЭлементаУпр/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Филиал) Тогда
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ПолучитьДоступныеПодразделенияМинздрава(Объект.Филиал));
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.ПодразделениеМинздрава.ПараметрыВыбора = НовыеПараметры;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ФилиалПриИзменении(Элемент)
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ПолучитьДоступныеПодразделенияМинздрава(Объект.Филиал));
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.ПодразделениеМинздрава.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьДоступныеПодразделенияМинздрава(Филиал)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтруктураПодразделенийАтрибуты.Ссылка КАК Подразделение
		|ИЗ
		|	Справочник.СтруктураПодразделений.Атрибуты КАК СтруктураПодразделенийАтрибуты
		|ГДЕ
		|	СтруктураПодразделенийАтрибуты.Ключ = ""MO_OID""
		|	И СтруктураПодразделенийАтрибуты.Значение = &MO_OID
		|	И СтруктураПодразделенийАтрибуты.Ссылка.Архив = ЛОЖЬ
		|	И СтруктураПодразделенийАтрибуты.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("MO_OID", Филиал.Организация.МедицинскаяОрганизация.OIDОрганизации);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Подразделение");
	
КонецФункции

#КонецОбласти
